tests/fixtures/webhooks/payment.sale.completed--from-subscription.json

{
	"id": "WH-2HB96170UN4612531-6PJ1555491044161R",
	"create_time": "2017-08-25T17:55:42.135Z",
	"resource_type": "sale",
	"event_type": "PAYMENT.SALE.COMPLETED",
	"summary": "Payment completed for $ 4.99 USD",
	"resource": {
		"amount": {
			"total": "4.99",
			"currency": "USD",
			"details": {}
		},
		"id": "7D51924877811803R",
		"update_time": "2017-08-25T17:55:09Z",
		"create_time": "2017-08-25T17:55:09Z",
		"payment_mode": "INSTANT_TRANSFER",
		"state": "completed",
		"links": [
			{
				"href": "https://api.sandbox.paypal.com/v1/payments/sale/7D51924877811803R",
				"rel": "self",
				"method": "GET"
			},
			{
				"href": "https://api.sandbox.paypal.com/v1/payments/sale/7D51924877811803R/refund",
				"rel": "refund",
				"method": "POST"
			}
		],
		"protection_eligibility_type": "ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE",
		"billing_agreement_id": "I-W0Y05RHBK9VG",
		"transaction_fee": {
			"value": "0.44",
			"currency": "USD"
		},
		"protection_eligibility": "ELIGIBLE"
	},
	"status": "SUCCESS",
	"transmissions": [
		{
			"webhook_url": "https://example.com",
			"response_headers": {
				"Date": "Fri, 25 Aug 2017 17:55:57 GMT",
				"Content-Length": "2"
			},
			"transmission_id": "9ca8cff0-89be-11e7-81c2-77339302725b",
			"status": "SUCCESS",
			"timestamp": "2017-08-25T17:55:42Z"
		}
	],
	"links": [
		{
			"href": "https://api.sandbox.paypal.com/v1/notifications/webhooks-events/WH-2HB96170UN4612531-6PJ1555491044161R",
			"rel": "self",
			"method": "GET",
			"encType": "application/json"
		},
		{
			"href": "https://api.sandbox.paypal.com/v1/notifications/webhooks-events/WH-2HB96170UN4612531-6PJ1555491044161R/resend",
			"rel": "resend",
			"method": "POST",
			"encType": "application/json"
		}
	],
	"event_version": "1.0"
}
